Revit 2027 API
Application.NewBoundingBoxXYZ Method
Creates a three-dimensional rectangular box.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxXYZ NewBoundingBoxXYZ()
Public Function NewBoundingBoxXYZ As BoundingBoxXYZ
public:
BoundingBoxXYZ^ NewBoundingBoxXYZ()
member NewBoundingBoxXYZ : unit -> BoundingBoxXYZ
Return Value
BoundingBoxXYZ
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace